modules/admin/controllers/PostsController.php

    public function actionUpdate($p, $slug)
    {
        $_SESSION['pages'] = $p;
        $model = Posts::findOne(['slug' => $slug]);
        $gambar_lama = $model->thumbnail;

        if ($this->request->isPost && $model->load($this->request->post()) ) {
            if ($model->thumbnail == null) {
                $model->thumbnail = $gambar_lama;
            }
            $upload = UploadedFile::getInstance($model, 'thumbnail');
            $name_file = rand();
            if (!empty($upload)) {
                $upload->saveAs('uploads/' . $name_file . '.' . $upload->extension);
                $model->thumbnail = $name_file . '.' . $upload->extension;
            }
            $model->save();
---
SELECT * FROM `posts` WHERE `slug`='cara-minum-kopi'
UPDATE `posts` SET `thumbnail`='19144296.png', `status`=1 WHERE `id`=1