views/layouts/layout.php

use yii\bootstrap5\Nav;
use yii\bootstrap5\NavBar;

$profile = Profile::findOne(['id' => 1]);
$pages = Pages::find()->all();
---
SELECT * FROM `profile` WHERE `id`=1
SELECT * FROM `pages`