views/layouts/main.php

SELECT * FROM `profile` WHERE `id`=1
SELECT * FROM `seo` WHERE `id`=1
SELECT * FROM `pages`
---
use yii\helpers\Url;
use yii\widgets\Pjax;

$profile = Profile::findOne(['id' => 1]);
$seo = Seo::findOne(1);
$pages = Pages::find()->all();