modules/admin/models/posts/PostsSearch.php

SELECT * FROM `pages` WHERE `slug`='artikel'
---
    public function searchPosts($params, $slug)
    {
        $pages = Pages::findOne(['slug' => $slug]);