controllers/SiteController.php

SELECT * FROM `pages` WHERE `slug`='artikel'
---
    public function actionPosts($slug)
    {
        $cek = Pages::findOne(['slug' => $slug]);