views/site/index.php

use yii\helpers\Url;
use yii\widgets\Pjax;

$pages = Pages::find()->where(['type' => 0])->all();
---
SELECT * FROM `pages` WHERE `type`=0

                <h3><?= $dataPages['name'] ?></h3>
            </div>
            <?php
            $posts = Posts::find()->where(['id_pages' => $dataPages['id']])->all();
---
SELECT * FROM `posts` WHERE `id_pages`=1